In [1]:
import pandas as pd
key=['name','age','city']
val=['Roaa','22','Tubas']
ser1=pd.Series(data=val,index=key)
print(ser1)

name     Roaa
age        22
city    Tubas
dtype: object

In [3]:
ser2=pd.Series(key)
ser2

0    name
1     age
2    city
dtype: object

In [9]:
df=pd.DataFrame(0,index=['x','y','z'],columns=['c1','c2'])
df.reset_index()

  index  c1  c2
0     x   0   0
1     y   0   0
2     z   0   0

In [24]:
import numpy as np
from numpy.random import randn
df1=pd.DataFrame(randn(6,2),index=['x','y','z','a','b','c'],columns=['c1','c2'])
np.random.seed(8765)
df1

         c1        c2
x  1.154902  0.753550
y  0.779250 -0.529266
z -0.241591  0.554079
a -0.554569 -0.210334
b  0.098990 -0.391707
c  0.205422 -1.711736

In [26]:
df1.head(n=3)

         c1        c2
x  1.154902  0.753550
y  0.779250 -0.529266
z -0.241591  0.554079

In [27]:
df1<=0

      c1     c2
x  False  False
y  False   True
z   True  False
a   True   True
b  False   True
c  False   True